espressif/arduino-esp32/boards.txt
adafruit_magtag29_esp32s2.menu.FlashSize.4M=4MB (32Mb)
adafruit_magtag29_esp32s2.menu.FlashSize.4M.build.flash_size=4MB
adafruit_magtag29_esp32s2.menu.FlashSize.8M=8MB (64Mb)
adafruit_magtag29_esp32s2.menu.FlashSize.8M.build.flash_size=8MB
adafruit_magtag29_esp32s2.menu.FlashSize.8M.build.partitions=default_8MB
adafruit_magtag29_esp32s2.menu.FlashSize.2M=2MB (16Mb)
adafruit_magtag29_esp32s2.menu.FlashSize.2M.build.flash_size=2MB
adafruit_magtag29_esp32s2.menu.FlashSize.2M.build.partitions=minimal
adafruit_magtag29_esp32s2.menu.FlashSize.16M=16MB (128Mb)
adafruit_magtag29_esp32s2.menu.FlashSize.16M.build.flash_size=16MB

adafruit_magtag29_esp32s2.menu.UploadSpeed.921600=921600
adafruit_magtag29_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_magtag29_esp32s2.menu.UploadSpeed.115200=115200
adafruit_magtag29_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_magtag29_esp32s2.menu.UploadSpeed.256000.windows=256000
adafruit_magtag29_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_magtag29_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_magtag29_esp32s2.menu.UploadSpeed.230400=230400
adafruit_magtag29_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_magtag29_esp32s2.menu.UploadSpeed.460800.linux=460800
adafruit_magtag29_esp32s2.menu.UploadSpeed.460800.macosx=460800
adafruit_magtag29_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_magtag29_esp32s2.menu.UploadSpeed.512000.windows=512000
adafruit_magtag29_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_magtag29_esp32s2.menu.DebugLevel.none=None
adafruit_magtag29_esp32s2.menu.DebugLevel.none.build.code_debug=0
adafruit_magtag29_esp32s2.menu.DebugLevel.error=Error
adafruit_magtag29_esp32s2.menu.DebugLevel.error.build.code_debug=1
adafruit_magtag29_esp32s2.menu.DebugLevel.warn=Warn
adafruit_magtag29_esp32s2.menu.DebugLevel.warn.build.code_debug=2
adafruit_magtag29_esp32s2.menu.DebugLevel.info=Info
adafruit_magtag29_esp32s2.menu.DebugLevel.info.build.code_debug=3
adafruit_magtag29_esp32s2.menu.DebugLevel.debug=Debug
adafruit_magtag29_esp32s2.menu.DebugLevel.debug.build.code_debug=4
adafruit_magtag29_esp32s2.menu.DebugLevel.verbose=Verbose
adafruit_magtag29_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

nodemcu-32s.name=NodeMCU-32S

nodemcu-32s.upload.tool=esptool_py
nodemcu-32s.upload.maximum_size=1310720
nodemcu-32s.upload.maximum_data_size=327680
nodemcu-32s.upload.flags=

nodemcu-32s.serial.disableDTR=true
nodemcu-32s.serial.disableRTS=true

nodemcu-32s.build.tarch=xtensa
nodemcu-32s.build.bootloader_addr=0x1000
nodemcu-32s.build.target=esp32
nodemcu-32s.build.mcu=esp32
nodemcu-32s.build.core=esp32
nodemcu-32s.build.variant=nodemcu-32s
nodemcu-32s.build.board=NodeMCU_32S

nodemcu-32s.build.f_cpu=240000000L
nodemcu-32s.build.flash_mode=dio
nodemcu-32s.build.flash_size=4MB
nodemcu-32s.build.boot=dio
nodemcu-32s.build.partitions=default
nodemcu-32s.build.defines=

nodemcu-32s.menu.FlashFreq.80=80MHz
nodemcu-32s.menu.FlashFreq.80.build.flash_freq=80m
nodemcu-32s.menu.FlashFreq.40=40MHz
nodemcu-32s.menu.FlashFreq.40.build.flash_freq=40m

nodemcu-32s.menu.UploadSpeed.921600=921600
nodemcu-32s.menu.UploadSpeed.921600.upload.speed=921600
nodemcu-32s.menu.UploadSpeed.115200=115200
nodemcu-32s.menu.UploadSpeed.115200.upload.speed=115200
nodemcu-32s.menu.UploadSpeed.256000.windows=256000
nodemcu-32s.menu.UploadSpeed.256000.upload.speed=256000
nodemcu-32s.menu.UploadSpeed.230400.windows.upload.speed=256000
nodemcu-32s.menu.UploadSpeed.230400=230400
nodemcu-32s.menu.UploadSpeed.230400.upload.speed=230400
nodemcu-32s.menu.UploadSpeed.460800.linux=460800
nodemcu-32s.menu.UploadSpeed.460800.macosx=460800
nodemcu-32s.menu.UploadSpeed.460800.upload.speed=460800
nodemcu-32s.menu.UploadSpeed.512000.windows=512000
nodemcu-32s.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

mhetesp32devkit.name=MH ET LIVE ESP32DevKIT

mhetesp32devkit.upload.tool=esptool_py
mhetesp32devkit.upload.maximum_size=1310720
mhetesp32devkit.upload.maximum_data_size=327680
mhetesp32devkit.upload.flags=

mhetesp32devkit.serial.disableDTR=true
mhetesp32devkit.serial.disableRTS=true

mhetesp32devkit.build.tarch=xtensa
mhetesp32devkit.build.bootloader_addr=0x1000
mhetesp32devkit.build.target=esp32
mhetesp32devkit.build.mcu=esp32
mhetesp32devkit.build.core=esp32
mhetesp32devkit.build.variant=mhetesp32devkit
mhetesp32devkit.build.board=MH_ET_LIVE_ESP32DEVKIT

mhetesp32devkit.build.f_cpu=240000000L
mhetesp32devkit.build.flash_mode=dio
mhetesp32devkit.build.flash_size=4MB
mhetesp32devkit.build.boot=dio
mhetesp32devkit.build.partitions=default
mhetesp32devkit.build.defines=

mhetesp32devkit.menu.FlashFreq.80=80MHz
mhetesp32devkit.menu.FlashFreq.80.build.flash_freq=80m
mhetesp32devkit.menu.FlashFreq.40=40MHz
mhetesp32devkit.menu.FlashFreq.40.build.flash_freq=40m

mhetesp32devkit.menu.PartitionScheme.default=Default
mhetesp32devkit.menu.PartitionScheme.default.build.partitions=default
mhetesp32devkit.menu.PartitionScheme.no_ota=No OTA (Large APP)
mhetesp32devkit.menu.PartitionScheme.no_ota.build.partitions=no_ota
mhetesp32devkit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mhetesp32devkit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
mhetesp32devkit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mhetesp32devkit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

mhetesp32devkit.menu.UploadSpeed.921600=921600
mhetesp32devkit.menu.UploadSpeed.921600.upload.speed=921600
mhetesp32devkit.menu.UploadSpeed.115200=115200
mhetesp32devkit.menu.UploadSpeed.115200.upload.speed=115200
mhetesp32devkit.menu.UploadSpeed.256000.windows=256000
mhetesp32devkit.menu.UploadSpeed.256000.upload.speed=256000
mhetesp32devkit.menu.UploadSpeed.230400.windows.upload.speed=256000
mhetesp32devkit.menu.UploadSpeed.230400=230400
mhetesp32devkit.menu.UploadSpeed.230400.upload.speed=230400
mhetesp32devkit.menu.UploadSpeed.460800.linux=460800
mhetesp32devkit.menu.UploadSpeed.460800.macosx=460800
mhetesp32devkit.menu.UploadSpeed.460800.upload.speed=460800
mhetesp32devkit.menu.UploadSpeed.512000.windows=512000
mhetesp32devkit.menu.UploadSpeed.512000.upload.speed=512000

mhetesp32devkit.menu.DebugLevel.none=None
mhetesp32devkit.menu.DebugLevel.none.build.code_debug=0
mhetesp32devkit.menu.DebugLevel.error=Error
mhetesp32devkit.menu.DebugLevel.error.build.code_debug=1
mhetesp32devkit.menu.DebugLevel.warn=Warn
mhetesp32devkit.menu.DebugLevel.warn.build.code_debug=2
mhetesp32devkit.menu.DebugLevel.info=Info
mhetesp32devkit.menu.DebugLevel.info.build.code_debug=3
mhetesp32devkit.menu.DebugLevel.debug=Debug
mhetesp32devkit.menu.DebugLevel.debug.build.code_debug=4
mhetesp32devkit.menu.DebugLevel.verbose=Verbose
mhetesp32devkit.menu.DebugLevel.verbose.build.code_debug=5

