espressif/arduino-esp32/boards.txt
mgbot-iotik32b.menu.FlashMode.qio=QIO
mgbot-iotik32b.menu.FlashMode.qio.build.flash_mode=dio
mgbot-iotik32b.menu.FlashMode.qio.build.boot=qio
mgbot-iotik32b.menu.FlashMode.dio=DIO
mgbot-iotik32b.menu.FlashMode.dio.build.flash_mode=dio
mgbot-iotik32b.menu.FlashMode.dio.build.boot=dio
mgbot-iotik32b.menu.FlashMode.qout=QOUT
mgbot-iotik32b.menu.FlashMode.qout.build.flash_mode=dout
mgbot-iotik32b.menu.FlashMode.qout.build.boot=qout
mgbot-iotik32b.menu.FlashMode.dout=DOUT
mgbot-iotik32b.menu.FlashMode.dout.build.flash_mode=dout
mgbot-iotik32b.menu.FlashMode.dout.build.boot=dout

mgbot-iotik32b.menu.FlashFreq.80=80MHz
mgbot-iotik32b.menu.FlashFreq.80.build.flash_freq=80m
mgbot-iotik32b.menu.FlashFreq.40=40MHz
mgbot-iotik32b.menu.FlashFreq.40.build.flash_freq=40m

mgbot-iotik32b.menu.FlashSize.4M=4MB (32Mb)
mgbot-iotik32b.menu.FlashSize.4M.build.flash_size=4MB
mgbot-iotik32b.menu.FlashSize.8M=8MB (64Mb)
mgbot-iotik32b.menu.FlashSize.8M.build.flash_size=8MB
mgbot-iotik32b.menu.FlashSize.8M.build.partitions=default_8MB
mgbot-iotik32b.menu.FlashSize.2M=2MB (16Mb)
mgbot-iotik32b.menu.FlashSize.2M.build.flash_size=2MB
mgbot-iotik32b.menu.FlashSize.2M.build.partitions=minimal
mgbot-iotik32b.menu.FlashSize.16M=16MB (128Mb)
mgbot-iotik32b.menu.FlashSize.16M.build.flash_size=16MB

mgbot-iotik32b.menu.UploadSpeed.921600=921600
mgbot-iotik32b.menu.UploadSpeed.921600.upload.speed=921600
mgbot-iotik32b.menu.UploadSpeed.115200=115200
mgbot-iotik32b.menu.UploadSpeed.115200.upload.speed=115200
mgbot-iotik32b.menu.UploadSpeed.256000.windows=256000
mgbot-iotik32b.menu.UploadSpeed.256000.upload.speed=256000
mgbot-iotik32b.menu.UploadSpeed.230400.windows.upload.speed=256000
mgbot-iotik32b.menu.UploadSpeed.230400=230400
mgbot-iotik32b.menu.UploadSpeed.230400.upload.speed=230400
mgbot-iotik32b.menu.UploadSpeed.460800.linux=460800
mgbot-iotik32b.menu.UploadSpeed.460800.macosx=460800
mgbot-iotik32b.menu.UploadSpeed.460800.upload.speed=460800
mgbot-iotik32b.menu.UploadSpeed.512000.windows=512000
mgbot-iotik32b.menu.UploadSpeed.512000.upload.speed=512000

mgbot-iotik32b.menu.DebugLevel.none=None
mgbot-iotik32b.menu.DebugLevel.none.build.code_debug=0
mgbot-iotik32b.menu.DebugLevel.error=Error
mgbot-iotik32b.menu.DebugLevel.error.build.code_debug=1
mgbot-iotik32b.menu.DebugLevel.warn=Warn
mgbot-iotik32b.menu.DebugLevel.warn.build.code_debug=2
mgbot-iotik32b.menu.DebugLevel.info=Info
mgbot-iotik32b.menu.DebugLevel.info.build.code_debug=3
mgbot-iotik32b.menu.DebugLevel.debug=Debug
mgbot-iotik32b.menu.DebugLevel.debug.build.code_debug=4
mgbot-iotik32b.menu.DebugLevel.verbose=Verbose
mgbot-iotik32b.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
piranha_esp-32.name=Piranha ESP-32

piranha_esp-32.upload.tool=esptool_py
piranha_esp-32.upload.maximum_size=1310720
piranha_esp-32.upload.maximum_data_size=327680
piranha_esp-32.upload.flags=

piranha_esp-32.serial.disableDTR=true
piranha_esp-32.serial.disableRTS=true

piranha_esp-32.build.tarch=xtensa
piranha_esp-32.build.bootloader_addr=0x1000
piranha_esp-32.build.target=esp32
piranha_esp-32.build.mcu=esp32
piranha_esp-32.build.core=esp32
piranha_esp-32.build.variant=piranha_esp-32
piranha_esp-32.build.board=Piranha

piranha_esp-32.build.f_cpu=240000000L
piranha_esp-32.build.flash_mode=dio
piranha_esp-32.build.flash_size=4MB
piranha_esp-32.build.boot=dio
piranha_esp-32.build.partitions=default
piranha_esp-32.build.defines=

piranha_esp-32.menu.PartitionScheme.default=Default
piranha_esp-32.menu.PartitionScheme.default.build.partitions=default
piranha_esp-32.menu.PartitionScheme.no_ota=No OTA (Large APP)
piranha_esp-32.menu.PartitionScheme.no_ota.build.partitions=no_ota
piranha_esp-32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
piranha_esp-32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
piranha_esp-32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
piranha_esp-32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

piranha_esp-32.menu.FlashFreq.80=80MHz
piranha_esp-32.menu.FlashFreq.80.build.flash_freq=80m
piranha_esp-32.menu.FlashFreq.40=40MHz
piranha_esp-32.menu.FlashFreq.40.build.flash_freq=40m

piranha_esp-32.menu.UploadSpeed.921600=921600
piranha_esp-32.menu.UploadSpeed.921600.upload.speed=921600
piranha_esp-32.menu.UploadSpeed.115200=115200
piranha_esp-32.menu.UploadSpeed.115200.upload.speed=115200
piranha_esp-32.menu.UploadSpeed.256000.windows=256000
piranha_esp-32.menu.UploadSpeed.256000.upload.speed=256000
piranha_esp-32.menu.UploadSpeed.230400.windows.upload.speed=256000
piranha_esp-32.menu.UploadSpeed.230400=230400
piranha_esp-32.menu.UploadSpeed.230400.upload.speed=230400
piranha_esp-32.menu.UploadSpeed.460800.linux=460800
piranha_esp-32.menu.UploadSpeed.460800.macosx=460800
piranha_esp-32.menu.UploadSpeed.460800.upload.speed=460800
piranha_esp-32.menu.UploadSpeed.512000.windows=512000
piranha_esp-32.menu.UploadSpeed.512000.upload.speed=512000

piranha_esp-32.menu.DebugLevel.none=None
piranha_esp-32.menu.DebugLevel.none.build.code_debug=0
piranha_esp-32.menu.DebugLevel.error=Error
piranha_esp-32.menu.DebugLevel.error.build.code_debug=1
piranha_esp-32.menu.DebugLevel.warn=Warn
piranha_esp-32.menu.DebugLevel.warn.build.code_debug=2
piranha_esp-32.menu.DebugLevel.info=Info
piranha_esp-32.menu.DebugLevel.info.build.code_debug=3
piranha_esp-32.menu.DebugLevel.debug=Debug
piranha_esp-32.menu.DebugLevel.debug.build.code_debug=4
piranha_esp-32.menu.DebugLevel.verbose=Verbose
piranha_esp-32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

metro_esp-32.name=Metro ESP-32

metro_esp-32.upload.tool=esptool_py
metro_esp-32.upload.maximum_size=1310720
metro_esp-32.upload.maximum_data_size=327680
metro_esp-32.upload.flags=

metro_esp-32.serial.disableDTR=true
metro_esp-32.serial.disableRTS=true

metro_esp-32.build.tarch=xtensa
metro_esp-32.build.bootloader_addr=0x1000
metro_esp-32.build.target=esp32
metro_esp-32.build.mcu=esp32
metro_esp-32.build.core=esp32
metro_esp-32.build.variant=metro_esp-32
metro_esp-32.build.board=Metro

